app/controllers/customers_controller.rb

  def show
    @orders = Customer.where(name: @customer.name).first.orders

    @orderSum = ''
    sum = 0

    @orders.each do |curr|
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."name" = 'Dagobert'  ORDER BY "customers"."id" ASC LIMIT 1
SELECT "orders".* FROM "orders"  WHERE "orders"."customer_id" = ?  [["customer_id", 1]]