app/controllers/line_items_controller.rb

INSERT INTO "line_items" ("amount", "created_at", "pumpkin_id", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 5], ["created_at", "2014-07-08 11:56:26.566134"], ["pumpkin_id", 1], ["updated_at", "2014-07-08 11:56:26.566134"]]
---
  def create
    @line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save

UPDATE "line_items" SET "order_id" = ?, "updated_at" = ? WHERE "line_items"."id" = 3  [["order_id", 3], ["updated_at", "2014-07-10 17:02:55.211923"]]
---
  def update
    respond_to do |format|
      if @line_item.update(line_item_params)