app/controllers/orders_controller.rb

  def show
    #@customer = @order.customer
    #raise params.inspect
    @line_items = LineItem.where(order_id: params[:id]).all
---
SELECT  "line_items".* FROM "line_items"  WHERE "line_items"."order_id" = 1  ORDER BY "line_items"."id" ASC LIMIT 1

  def new
    #raise params.inspect
    if params["customer"]
      @customer = Customer.find(params["customer"])
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("created_at", "customer_id", "placed_on", "price", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-06-29 13:40:42.912847"], ["customer_id", 1], ["placed_on", "2014-06-29"], ["price", 5.25], ["status", "new"], ["updated_at", "2014-06-29 13:40:42.912847"]]