app/controllers/pumpkins_controller.rb

SELECT "pumpkins".* FROM "pumpkins"   ORDER BY "pumpkins"."price" DESC
SELECT "pumpkins".* FROM "pumpkins"
---
  def index

    # raise params.inspect
    case params[:order_by]
      when "price"
        if params[:order_direction] == "asc" then
          @pumpkins = Pumpkin.order(price: :asc)
        elsif params[:order_direction] == "desc" then
          @pumpkins = Pumpkin.order(price: :desc)
        end
      else
      @pumpkins = Pumpkin.all

INSERT INTO "pumpkins" ("color", "created_at", "name", "price", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["color", "redish"], ["created_at", "2014-07-01 10:16:00.502051"], ["name", "test"], ["price", 0.01], ["size", 123], ["updated_at", "2014-07-01 10:16:00.502051"]]
---
  def create
    @pumpkin = Pumpkin.new(pumpkin_params)

    respond_to do |format|
      if @pumpkin.save

SELECT  "pumpkins".* FROM "pumpkins"  WHERE "pumpkins"."id" = ? LIMIT 1  [["id", 17]]
---
    def set_pumpkin
      @pumpkin = Pumpkin.find(params[:id])